Pandas is a Python library used for data manipulation and analysis. It provides data structures like Series (1D) and DataFrames (2D) to efficiently handle tabular data, similar to spreadsheets or SQL tables. Pandas is built on top of NumPy and integrates well with other Python libraries, making it a cornerstone of the PyData ecosystem

In [4]:
import pandas as pd
## seies single column
data = [1,2,3,4,5]
series=pd.Series(data)
print("Series: \n", series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
## create series from dict
data = {'a':1, 'b':2}
series_dict = pd.Series(data)
print(series_dict)
## key will become index

a    1
b    2
dtype: int64

In [7]:
data = [10,20,30]
index= ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [9]:
## Dataframe
## create a dataframe from dict of list

data ={'Name':["Pulin","Priyanka","Leo"],
       "Age":[36,35,70]
}
df=pd.DataFrame(data)
print(df)

       Name  Age
0     Pulin   36
1  Priyanka   35
2       Leo   70

In [11]:
df=pd.read_csv("/Users/pulin05/Downloads/archive/Details.csv")
df.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [12]:
df.tail()

     Order ID  Amount  Profit  Quantity     Category Sub-Category PaymentMode
1495  B-25700       7      -3         2     Clothing  Hankerchief         COD
1496  B-25757    3151     -35         7     Clothing     Trousers         EMI
1497  B-25973    4141    1698        13  Electronics     Printers         COD
1498  B-25698       7      -2         1     Clothing  Hankerchief         COD
1499  B-25993    4363     305         5    Furniture       Tables         EMI

In [ ]:
### accessing data from dataframe

data ={'Name':["Pulin","Priyanka","Leo"],
       "Age":[36,35,70]
}
df=pd.DataFrame(data)
df['Name']

       Name  Age
0     Pulin   36
1  Priyanka   35
2       Leo   70

0       Pulin
1    Priyanka
2         Leo
Name: Name, dtype: object

In [ ]:
df.loc[0][0] ##

/var/folders/r6/ll0mn_f10xv5sjtcfcsw16880000gn/T/ipykernel_53227/2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Pulin'

In [ ]:
df.iloc[0]

Name    Pulin
Age        36
Name: 0, dtype: object

In [20]:
df.at[1,'Name']

'Priyanka'

In [22]:
df.iat[1,1]

35

In [24]:
### Data manupliation with df
df['city']=['lko','goa','agra']
df

       Name  Age  city
0     Pulin   36   lko
1  Priyanka   35   goa
2       Leo   70  agra

In [29]:
df.drop('city', axis=1, inplace=True) ## default axis is row axis i.e = 0 so change it to column

## not permanent operation so use inplace param

In [30]:
df

       Name  Age
0     Pulin   36
1  Priyanka   35
2       Leo   70

In [31]:
df['Age']= df["Age"]+1

In [ ]:
df.drop(2, inplace=True) ### remove row 2